#include <stdio.h>

// int main(){
//     double a = 5 / 2;// 商2 余1
//     // 如果想实现得到精确的数字，则需要使两个除数之间有一个为浮点型
//     double c = 2;
//     double b = 5 / 2.0;
//     c = 5.0 / 2;
//     double d = c / 1;
//     printf("a = %f\n",a); // 2.000因为两个整数相除
//     printf("b = %f\n",b);
//     printf("c = %f\n",c);
//     printf("d = %f\n",d);

//     // 对于取模来说只能'%'两边都是整数才行，否则编译器报错
//     // int A = 5 % 2.0;
//     return 0;
// }

// int main(){
//     int a = 16;
//     // >> ： 右移操作符
//     // 移动的是二进制位
//     // 正整数的原码、反码、补码相同
//     // 00000000000000000000000000010000
//     // 下面的移位相当于除于2
//     int b = a >> 1;// 算术右移
    
//     return 0;
// }

// int main(){
//     int a = -1;
//     // 正数的二进制表示有：原码、反码、补码
//     // 存储到内存中的是补码
//     // 10000000000000000000000000000001 - 原码 
//     // 11111111111111111111111111111110 - 反码 
//     // 11111111111111111111111111111111 - 补码 = 反码 + 1 
//     int b = a >> 1; 
//     // 这里向右丢了个1，但是算术右移，补了一个1，因此补码仍然还是-1 

//     return 0;
// }

// int main(){
//     int a = 5 ;
//     int b = a << 1;
//     // 实际上相当于乘以2
//     return 0;
// }


//int main(){
    // & - 按2进制按位与
    // int a = 3;
    // int b = 5;
    // int c = a&b;
    // //00000000000000000000000000000011
    // //00000000000000000000000000000101
    // // |||   通过按位与得到以下数字    |||
    // //00000000000000000000000000000001
    // printf("%d\n",c); // 1

    // | - 按二进制按位或
    // int a = 3;
    // int b = 5;
    // //00000000000000000000000000000011
    // //00000000000000000000000000000101
    // //00000000000000000000000000000111
    // int c = a | b; // 7

    // ^ - 按2进制按位异或
    // int a = 3;
    // int b = 5;
    // int c = a ^ b; // 6
    //00000000000000000000000000000011
    //00000000000000000000000000000101
    //00000000000000000000000000000110
        
    // return 0;
// }

// int main(){
//     int a = 3 ;
//     int b = 5 ;
    
//     // 加减法 -- 可能会溢出
//     a = a + b;
//     b = a - b;
//     a = a - b;

//     // 异或法
//     a = a ^ b;
//     b = a ^ b;
//     a = a ^ b;

//     printf("%d %d\n",a,b);
//     return 0;
// }


int main(){
// 这种算法计算一个数在内存中存储的1，只能计算正数
    int num ;
    int count = 0;
    scanf("%d",&num);
    // 统计num的补码中有几个1
    // while(num){
    //     if(num % 2 == 1){
    //         count ++;
    //     }
    //     num /= 2;
    // }

    // 32 bit
    // num & 1 == 1
    // 00000000000000000000000000000011
    // 00000000000000000000000000000001
    // 按位与
    // 00000000000000000000000000000001
    for(int i = 0 ; i < 32 ; i ++){
        if((num >> i) & 1){
            count ++;
        }
    }

    printf("------>%d\n",count);
    return 0;
}

