#include <stdio.h>

int main(){
    /*
    // 移 (2进制) 移位操作符
    // << 左移操作符
    // >> 右移操作符

    int a = 1 ; 
    // 整型1占4个字节 - 32 bit位
    // 00000000000000000000000000000001
    int b = a<<2;
    printf("%d\n",b);
    printf("%d\n",a);
    return 0;
    */

   //(2进制)位操作
   // & 按位与
   // | 按位或
   // ^ 按位异或
//    int a = 3;
//    int b = 5;
//    int c = a&b;
        // 011
        // 101
        // 通过按位或变成下方001
        // 001 = 1

    // int a = 3;
    // int b = 5;
    // int c = a|b;
    // 011
    // 101
    // 通过按位或变成下方
    // 111 = 7 

    // 异或的计算规律：
    // 对应的2进制位相同，则为0，对应的2进制相异，则为1。
    // int a = 3;
    // int b = 5;
    // int c = a^b;
    // // 011
    // // 101
    // 通过按位异或变成下方
    // 110 = 6

//     int a = 0 ; 
//     //a 000000000000000000000000
//     //b 111111111111111111111111

//     // 原码、反码、补码 ： 反码 + 1 = 补码  反码取反 = 原码（负号位不变，其他取反）

//     // 补码 111111111111111111111111
//     // 反码 111111111111111111111110
//     // 原码 100000000000000000000001
    
//     int b = ~a;// b是有符号的整形
//     // b的输出结果是-1 

//    printf("%d\n",b);
   return 0;
}