#include <stdio.h>

// int main(){
//     char a = 3;
//     // 00000000000000000000000000000011
//     // a -> 00000011 
//     char b = 127;
//     // 00000000000000000000000001111111
//     // b -> 01111111

//     // a和b如何相加
//     // 00000000000000000000000000000011
//     // +++++
//     // 00000000000000000000000001111111
//     // =====
//     // 00000000000000000000000010000010
//     char c = a + b;
//     // c - > 10000010
//     // 11111111111111111111111110000010 - 补码
//     // 11111111111111111111111110000001 - 反码
//     // 10000000000000000000000001111110 - 原码
//     printf("%d\n",c);
//     return 0;
// }

// int main(){
//     char a = 0xb6;
//     short b = 0xb600;
//     int c = 0xb6000000;
//     if(a == 0xb6){
//         printf("a");
//     }
//     if(b == 0xb600 ){
//         printf("b");
//     }
//     if(c == 0xb6000000){
//         printf("c");
//     }
//     return 0;
// }

// 一个小于整形的类型，参与符号运算，会产生整形提升，按照其符号位进行高位的补齐
// int main(){
//     char c = 1;
//     printf("%lu\n",sizeof(c)); // 1
//     printf("%lu\n",sizeof(+c)); // 4
//     printf("%lu\n",sizeof(!c)); // 4
//     return 0;
// }

// int main(){
//     int a = 10;
//     int b = 20;
//     int c = b + a * 3;
//     return 0;
// }